import '../../css/MyProduct.css';
import '../../css/Admin_Home.css';
import '../../css/AdminCheckProduct.css';
import '../../css/AdminManageTable.css';

function PrivacyPolicy() {

    return (
        <center>
            <div style={{ height: 'auto', width: '90%', color: '#111', backgroundColor: '#fff' }} className='contentPage'>

                <div style={{ padding: '0 2rem 2rem 2rem'  }}>

                    <h1>นโยบายความเป็นส่วนตัว</h1>

                    ยินดีต้อนรับสู่ Yakkai! เราเข้าใจความสำคัญของความเป็นส่วนตัวของคุณและข้อมูลส่วนตัวของผู้ใช้งานทุกคน<br />
                    ดังนั้นเรามุ่งมั่นในการปกป้องและรักษาความเป็นส่วนตัวของคุณอย่างเคร่งครัด นี่คือนโยบายความเป็นส่วนตัวของเรา:

                    <h2>1. ข้อมูลส่วนบุคคลที่เราเก็บรวบรวม</h2>

                    เราจะเก็บข้อมูลส่วนบุคคลที่คุณให้ไว้ในระหว่างกระบวนการลงทะเบียน ซึ่งรวมถึงชื่อผู้ใช้, เบอร์โทรศัพท์, ที่อยู่อีเมล<br />
                    ,เพศ(ระบุหรือไม่ก็ได้), ข้อมูลเพิ่มเติมเกี่ยวกับคุณ(ระบุหรือไม่ก็ได้), รูปภาพของคุณ(ระบุหรือไม่ก็ได้), ข้อมูลเหล่านี้จะถูกใช้เพื่อการติดต่อและประสานงาน<br />
                    ในรายละเอียดของการซื้อขายสินค้าบนเว็บไซต์ของเราเท่านั้น

                    <h2>2. การความปลอดภัยของข้อมูล</h2>

                    เรามีมาตรการรักษาความปลอดภัยที่เข้มงวดเพื่อป้องกันข้อมูลส่วนบุคคลของคุณจากการเข้าถึงโดยไม่ได้รับอนุญาต<br />
                    ข้อมูลของคุณจะถูกเก็บรักษาอย่างปลอดภัยและเราจะไม่เปิดเผยหรือแบ่งปันข้อมูลดังกล่าวกับบุคคลภายนอก<br />
                    เว้นเฉพาะในกรณีที่เราจำเป็นต้องทำเช่นการติดต่อผู้ขายหรือการตรวจสอบการลงทะเบียน

                    <h2>3. การป้องกันการโกงและการใช้ข้อมูล</h2>

                    เราไม่มีนโยบายให้ผู้ซื้อโอนเงินก่อนรับสินค้า ฉะนั้นหากมีการโกงหรือปัญหาเกิดขึ้นจากความไม่ระมัดระวังของผู้ซื้อ<br />
                    ทางเราจะช่วยให้ความช่วยเหลือและดำเนินการผสานงานเต็มที่ อย่างไรก็ตาม Yakkai จะไม่รับผิดชอบใด ๆ ในกรณีที่เกิดความเสียหายหรือการสูญเสีย

                    <h2> 4. การเปิดเผยข้อมูลของผู้ใช้</h2>

                    เราจะไม่เปิดเผยข้อมูลส่วนบุคคลของผู้ใช้เว้นเสียจากผู้ใช้งานได้กระทำการโกงหรือกระทำการไม่ถูกต้องที่ทำให้เราจำเป็นต้องเปิดเผยข้อมูล

                    <h2>5. การเปลี่ยนแปลงนโยบาย</h2>

                    เราอาจปรับปรุงนโยบายความเป็นส่วนตัวเพื่อประสานงานกับการเปลี่ยนแปลงในกฎหมายหรือการดำเนินงานของเว็บไซต์เราจะแจ้งให้คุณทราบเมื่อมีการเปลี่ยนแปลงข้อมูลนี้<br />

                    โดยการใช้งานเว็บไซต์ของเรา คุณยินยอมและยอมรับนโยบายความเป็นส่วนตัวของเรา เราขอขอบคุณที่เลือกใช้ Yakkai และเราหวังว่าคุณจะมีประสบการณ์ที่ยอดเยี่ยมในการซื้อขายสินค้ามือสองกับเรา!"
                </div>


            </div>
        </center>
    )
}

export default PrivacyPolicy;